Tekla.Structures.Drawing.InvalidPluginPickerInputException
The InvalidPluginPickerInputException class defines the exception that is
thrown when UI.Picker is used during a Plugin.Insert call but the previously
assigned PluginPickerInput does not correspond to the next UI.Picker call.

Tekla.Structures.Drawing.InvalidPluginPickerInputException.#ctor
Creates a new InvalidPluginPickerInputException instance.

Tekla.Structures.Drawing.InvalidPluginPickerInputException.#ctor(System.Runtime.Serialization.SerializationInfo,System.Runtime.Serialization.StreamingContext)
Initializes a new instance with serialized data.
info: The object that holds the serialized object data.
context: The contextual information about the source or destination.